In [1]:
import pandas as pd

In [2]:
data = {
    "name":["subham","shayan","niladri","biltu"], 
    "age":[14, 13,19,14], 
    "programming":["python",None,"javascript",None], 
    "experience":[2,1,5,None], 
    "salary":[10000,5000,50000,None]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

      name  age programming  experience   salary
0   subham   14      python         2.0  10000.0
1   shayan   13        None         1.0   5000.0
2  niladri   19  javascript         5.0  50000.0
3    biltu   14        None         NaN      NaN

In [5]:
df.to_csv("employee.csv") 
df.to_json("employee.json")

In [6]:
df2 = pd.read_csv("employee.csv") 
df3=pd.read_json("employee.json")

In [7]:
df2

   Unnamed: 0     name  age programming  experience   salary
0           0   subham   14      python         2.0  10000.0
1           1   shayan   13         NaN         1.0   5000.0
2           2  niladri   19  javascript         5.0  50000.0
3           3    biltu   14         NaN         NaN      NaN

In [8]:
df3

      name  age programming  experience   salary
0   subham   14      python         2.0  10000.0
1   shayan   13        None         1.0   5000.0
2  niladri   19  javascript         5.0  50000.0
3    biltu   14        None         NaN      NaN

In [9]:

df2.tail(2)

   Unnamed: 0     name  age programming  experience   salary
2           2  niladri   19  javascript         5.0  50000.0
3           3    biltu   14         NaN         NaN      NaN

In [10]:
df.head(2)

     name  age programming  experience   salary
0  subham   14      python         2.0  10000.0
1  shayan   13        None         1.0   5000.0

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   4 non-null      int64
 1   name         4 non-null      object
 2   age          4 non-null      int64
 3   programming  2 non-null      object
 4   experience   3 non-null      float64
 5   salary       3 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 232.0+ bytes

In [12]:
df2.describe()

       Unnamed: 0        age  experience        salary
count    4.000000   4.000000    3.000000      3.000000
mean     1.500000  15.000000    2.666667  21666.666667
std      1.290994   2.708013    2.081666  24664.414312
min      0.000000  13.000000    1.000000   5000.000000
25%      0.750000  13.750000    1.500000   7500.000000
50%      1.500000  14.000000    2.000000  10000.000000
75%      2.250000  15.250000    3.500000  30000.000000
max      3.000000  19.000000    5.000000  50000.000000

In [13]:
df2.shape

(4, 6)

In [14]:
df2.columns

Index(['Unnamed: 0', 'name', 'age', 'programming', 'experience', 'salary'], dtype='object')

In [15]:
age = df[df["age"]>=14]
print(age)

      name  age programming  experience   salary
0   subham   14      python         2.0  10000.0
2  niladri   19  javascript         5.0  50000.0
3    biltu   14        None         NaN      NaN

In [16]:
df2.insert(2, "address", ["cpt market"," bankira","super market","cpt market"])

In [17]:
df2

   Unnamed: 0     name       address  age programming  experience   salary
0           0   subham    cpt market   14      python         2.0  10000.0
1           1   shayan       bankira   13         NaN         1.0   5000.0
2           2  niladri  super market   19  javascript         5.0  50000.0
3           3    biltu    cpt market   14         NaN         NaN      NaN

In [18]:
df2.loc[1, "age"]=14

In [19]:
df2

   Unnamed: 0     name       address  age programming  experience   salary
0           0   subham    cpt market   14      python         2.0  10000.0
1           1   shayan       bankira   14         NaN         1.0   5000.0
2           2  niladri  super market   19  javascript         5.0  50000.0
3           3    biltu    cpt market   14         NaN         NaN      NaN

In [20]:
df2.drop(columns=["address"],inplace=True)

In [21]:
df2

   Unnamed: 0     name  age programming  experience   salary
0           0   subham   14      python         2.0  10000.0
1           1   shayan   14         NaN         1.0   5000.0
2           2  niladri   19  javascript         5.0  50000.0
3           3    biltu   14         NaN         NaN      NaN

In [22]:
df.isnull()

    name    age  programming  experience  salary
0  False  False        False       False   False
1  False  False         True       False   False
2  False  False        False       False   False
3  False  False         True        True    True

In [23]:
df.isnull().sum()

name           0
age            0
programming    2
experience     1
salary         1
dtype: int64

In [24]:
df.dropna(axis=0)

      name  age programming  experience   salary
0   subham   14      python         2.0  10000.0
2  niladri   19  javascript         5.0  50000.0

In [25]:
df2.fillna(0, inplace=True)

In [26]:
df2

   Unnamed: 0     name  age programming  experience   salary
0           0   subham   14      python         2.0  10000.0
1           1   shayan   14           0         1.0   5000.0
2           2  niladri   19  javascript         5.0  50000.0
3           3    biltu   14           0         0.0      0.0